{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "#importing necessary libraries\n",
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import datetime\n",
    "from collections import Counter\n",
    "from sklearn.metrics.pairwise import cosine_similarity"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: neo4j in c:\\users\\adhish s\\appdata\\local\\programs\\python\\python37\\lib\\site-packages (5.11.0)\n",
      "Requirement already satisfied: pytz in c:\\users\\adhish s\\appdata\\local\\programs\\python\\python37\\lib\\site-packages (from neo4j) (2023.3.post1)\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "\n",
      "[notice] A new release of pip is available: 23.2.1 -> 23.3\n",
      "[notice] To update, run: python.exe -m pip install --upgrade pip\n"
     ]
    }
   ],
   "source": [
    "!pip install neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "#loading the data\n",
    "genome_scores_data = pd.read_csv(r\"C:\\Users\\ADHISH S\\Desktop\\Datasets\\ml-25m\\ml-25m\\genome-scores.csv\") \n",
    "movies_data = pd.read_csv(r\"C:\\Users\\ADHISH S\\Desktop\\Datasets\\ml-25m\\ml-25m\\movies.csv\") \n",
    "ratings_data = pd.read_csv(r\"C:\\Users\\ADHISH S\\Desktop\\Datasets\\ml-25m\\ml-25m\\ratings.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>tagId</th>\n",
       "      <th>relevance</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>0.02875</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>0.02375</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "      <td>0.06250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "      <td>0.07575</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>0.14075</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>1</td>\n",
       "      <td>6</td>\n",
       "      <td>0.14675</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "      <td>0.06350</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1</td>\n",
       "      <td>8</td>\n",
       "      <td>0.20375</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>1</td>\n",
       "      <td>9</td>\n",
       "      <td>0.20200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>1</td>\n",
       "      <td>10</td>\n",
       "      <td>0.03075</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId  tagId  relevance\n",
       "0        1      1    0.02875\n",
       "1        1      2    0.02375\n",
       "2        1      3    0.06250\n",
       "3        1      4    0.07575\n",
       "4        1      5    0.14075\n",
       "5        1      6    0.14675\n",
       "6        1      7    0.06350\n",
       "7        1      8    0.20375\n",
       "8        1      9    0.20200\n",
       "9        1     10    0.03075"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#data exloration\n",
    "genome_scores_data.head(10)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['movieId', 'tagId', 'relevance'], dtype='object')"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "genome_scores_data.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>title</th>\n",
       "      <th>genres</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Toy Story (1995)</td>\n",
       "      <td>Adventure|Animation|Children|Comedy|Fantasy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>Jumanji (1995)</td>\n",
       "      <td>Adventure|Children|Fantasy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>Grumpier Old Men (1995)</td>\n",
       "      <td>Comedy|Romance</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>Waiting to Exhale (1995)</td>\n",
       "      <td>Comedy|Drama|Romance</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>Father of the Bride Part II (1995)</td>\n",
       "      <td>Comedy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>6</td>\n",
       "      <td>Heat (1995)</td>\n",
       "      <td>Action|Crime|Thriller</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>7</td>\n",
       "      <td>Sabrina (1995)</td>\n",
       "      <td>Comedy|Romance</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>8</td>\n",
       "      <td>Tom and Huck (1995)</td>\n",
       "      <td>Adventure|Children</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>9</td>\n",
       "      <td>Sudden Death (1995)</td>\n",
       "      <td>Action</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>10</td>\n",
       "      <td>GoldenEye (1995)</td>\n",
       "      <td>Action|Adventure|Thriller</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId                               title  \\\n",
       "0        1                    Toy Story (1995)   \n",
       "1        2                      Jumanji (1995)   \n",
       "2        3             Grumpier Old Men (1995)   \n",
       "3        4            Waiting to Exhale (1995)   \n",
       "4        5  Father of the Bride Part II (1995)   \n",
       "5        6                         Heat (1995)   \n",
       "6        7                      Sabrina (1995)   \n",
       "7        8                 Tom and Huck (1995)   \n",
       "8        9                 Sudden Death (1995)   \n",
       "9       10                    GoldenEye (1995)   \n",
       "\n",
       "                                        genres  \n",
       "0  Adventure|Animation|Children|Comedy|Fantasy  \n",
       "1                   Adventure|Children|Fantasy  \n",
       "2                               Comedy|Romance  \n",
       "3                         Comedy|Drama|Romance  \n",
       "4                                       Comedy  \n",
       "5                        Action|Crime|Thriller  \n",
       "6                               Comedy|Romance  \n",
       "7                           Adventure|Children  \n",
       "8                                       Action  \n",
       "9                    Action|Adventure|Thriller  "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "movies_data.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userId</th>\n",
       "      <th>movieId</th>\n",
       "      <th>rating</th>\n",
       "      <th>timestamp</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>296</td>\n",
       "      <td>5.0</td>\n",
       "      <td>1147880044</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>306</td>\n",
       "      <td>3.5</td>\n",
       "      <td>1147868817</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>307</td>\n",
       "      <td>5.0</td>\n",
       "      <td>1147868828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>665</td>\n",
       "      <td>5.0</td>\n",
       "      <td>1147878820</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>899</td>\n",
       "      <td>3.5</td>\n",
       "      <td>1147868510</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   userId  movieId  rating   timestamp\n",
       "0       1      296     5.0  1147880044\n",
       "1       1      306     3.5  1147868817\n",
       "2       1      307     5.0  1147868828\n",
       "3       1      665     5.0  1147878820\n",
       "4       1      899     3.5  1147868510"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ratings_data.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th>tagId</th>\n",
       "      <th>movieId</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "      <th>...</th>\n",
       "      <th>1119</th>\n",
       "      <th>1120</th>\n",
       "      <th>1121</th>\n",
       "      <th>1122</th>\n",
       "      <th>1123</th>\n",
       "      <th>1124</th>\n",
       "      <th>1125</th>\n",
       "      <th>1126</th>\n",
       "      <th>1127</th>\n",
       "      <th>1128</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>0.02875</td>\n",
       "      <td>0.02375</td>\n",
       "      <td>0.06250</td>\n",
       "      <td>0.07575</td>\n",
       "      <td>0.14075</td>\n",
       "      <td>0.14675</td>\n",
       "      <td>0.06350</td>\n",
       "      <td>0.20375</td>\n",
       "      <td>0.2020</td>\n",
       "      <td>...</td>\n",
       "      <td>0.04050</td>\n",
       "      <td>0.01425</td>\n",
       "      <td>0.03050</td>\n",
       "      <td>0.03500</td>\n",
       "      <td>0.14125</td>\n",
       "      <td>0.05775</td>\n",
       "      <td>0.03900</td>\n",
       "      <td>0.02975</td>\n",
       "      <td>0.08475</td>\n",
       "      <td>0.02200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>0.04125</td>\n",
       "      <td>0.04050</td>\n",
       "      <td>0.06275</td>\n",
       "      <td>0.08275</td>\n",
       "      <td>0.09100</td>\n",
       "      <td>0.06125</td>\n",
       "      <td>0.06925</td>\n",
       "      <td>0.09600</td>\n",
       "      <td>0.0765</td>\n",
       "      <td>...</td>\n",
       "      <td>0.05250</td>\n",
       "      <td>0.01575</td>\n",
       "      <td>0.01250</td>\n",
       "      <td>0.02000</td>\n",
       "      <td>0.12225</td>\n",
       "      <td>0.03275</td>\n",
       "      <td>0.02100</td>\n",
       "      <td>0.01100</td>\n",
       "      <td>0.10525</td>\n",
       "      <td>0.01975</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>0.04675</td>\n",
       "      <td>0.05550</td>\n",
       "      <td>0.02925</td>\n",
       "      <td>0.08700</td>\n",
       "      <td>0.04750</td>\n",
       "      <td>0.04775</td>\n",
       "      <td>0.04600</td>\n",
       "      <td>0.14275</td>\n",
       "      <td>0.0285</td>\n",
       "      <td>...</td>\n",
       "      <td>0.06275</td>\n",
       "      <td>0.01950</td>\n",
       "      <td>0.02225</td>\n",
       "      <td>0.02300</td>\n",
       "      <td>0.12200</td>\n",
       "      <td>0.03475</td>\n",
       "      <td>0.01700</td>\n",
       "      <td>0.01800</td>\n",
       "      <td>0.09100</td>\n",
       "      <td>0.01775</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>0.03425</td>\n",
       "      <td>0.03800</td>\n",
       "      <td>0.04050</td>\n",
       "      <td>0.03100</td>\n",
       "      <td>0.06500</td>\n",
       "      <td>0.03575</td>\n",
       "      <td>0.02900</td>\n",
       "      <td>0.08650</td>\n",
       "      <td>0.0320</td>\n",
       "      <td>...</td>\n",
       "      <td>0.05325</td>\n",
       "      <td>0.02800</td>\n",
       "      <td>0.01675</td>\n",
       "      <td>0.03875</td>\n",
       "      <td>0.18200</td>\n",
       "      <td>0.07050</td>\n",
       "      <td>0.01625</td>\n",
       "      <td>0.01425</td>\n",
       "      <td>0.08850</td>\n",
       "      <td>0.01500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>0.04300</td>\n",
       "      <td>0.05325</td>\n",
       "      <td>0.03800</td>\n",
       "      <td>0.04100</td>\n",
       "      <td>0.05400</td>\n",
       "      <td>0.06725</td>\n",
       "      <td>0.02775</td>\n",
       "      <td>0.07650</td>\n",
       "      <td>0.0215</td>\n",
       "      <td>...</td>\n",
       "      <td>0.05350</td>\n",
       "      <td>0.02050</td>\n",
       "      <td>0.01425</td>\n",
       "      <td>0.02550</td>\n",
       "      <td>0.19225</td>\n",
       "      <td>0.02675</td>\n",
       "      <td>0.01625</td>\n",
       "      <td>0.01300</td>\n",
       "      <td>0.08700</td>\n",
       "      <td>0.01600</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 1129 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "tagId  movieId        1        2        3        4        5        6        7  \\\n",
       "0            1  0.02875  0.02375  0.06250  0.07575  0.14075  0.14675  0.06350   \n",
       "1            2  0.04125  0.04050  0.06275  0.08275  0.09100  0.06125  0.06925   \n",
       "2            3  0.04675  0.05550  0.02925  0.08700  0.04750  0.04775  0.04600   \n",
       "3            4  0.03425  0.03800  0.04050  0.03100  0.06500  0.03575  0.02900   \n",
       "4            5  0.04300  0.05325  0.03800  0.04100  0.05400  0.06725  0.02775   \n",
       "\n",
       "tagId        8       9  ...     1119     1120     1121     1122     1123  \\\n",
       "0      0.20375  0.2020  ...  0.04050  0.01425  0.03050  0.03500  0.14125   \n",
       "1      0.09600  0.0765  ...  0.05250  0.01575  0.01250  0.02000  0.12225   \n",
       "2      0.14275  0.0285  ...  0.06275  0.01950  0.02225  0.02300  0.12200   \n",
       "3      0.08650  0.0320  ...  0.05325  0.02800  0.01675  0.03875  0.18200   \n",
       "4      0.07650  0.0215  ...  0.05350  0.02050  0.01425  0.02550  0.19225   \n",
       "\n",
       "tagId     1124     1125     1126     1127     1128  \n",
       "0      0.05775  0.03900  0.02975  0.08475  0.02200  \n",
       "1      0.03275  0.02100  0.01100  0.10525  0.01975  \n",
       "2      0.03475  0.01700  0.01800  0.09100  0.01775  \n",
       "3      0.07050  0.01625  0.01425  0.08850  0.01500  \n",
       "4      0.02675  0.01625  0.01300  0.08700  0.01600  \n",
       "\n",
       "[5 rows x 1129 columns]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "# Pivot the data to create mov_tag_df\n",
    "scores_pivot = genome_scores_data.pivot_table(index=['movieId'], columns=['tagId'], values='relevance').reset_index()\n",
    "\n",
    "scores_pivot.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "      <th>...</th>\n",
       "      <th>1119</th>\n",
       "      <th>1120</th>\n",
       "      <th>1121</th>\n",
       "      <th>1122</th>\n",
       "      <th>1123</th>\n",
       "      <th>1124</th>\n",
       "      <th>1125</th>\n",
       "      <th>1126</th>\n",
       "      <th>1127</th>\n",
       "      <th>1128</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>0.02875</td>\n",
       "      <td>0.02375</td>\n",
       "      <td>0.06250</td>\n",
       "      <td>0.07575</td>\n",
       "      <td>0.14075</td>\n",
       "      <td>0.14675</td>\n",
       "      <td>0.06350</td>\n",
       "      <td>0.20375</td>\n",
       "      <td>0.2020</td>\n",
       "      <td>...</td>\n",
       "      <td>0.04050</td>\n",
       "      <td>0.01425</td>\n",
       "      <td>0.03050</td>\n",
       "      <td>0.03500</td>\n",
       "      <td>0.14125</td>\n",
       "      <td>0.05775</td>\n",
       "      <td>0.03900</td>\n",
       "      <td>0.02975</td>\n",
       "      <td>0.08475</td>\n",
       "      <td>0.02200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>0.04125</td>\n",
       "      <td>0.04050</td>\n",
       "      <td>0.06275</td>\n",
       "      <td>0.08275</td>\n",
       "      <td>0.09100</td>\n",
       "      <td>0.06125</td>\n",
       "      <td>0.06925</td>\n",
       "      <td>0.09600</td>\n",
       "      <td>0.0765</td>\n",
       "      <td>...</td>\n",
       "      <td>0.05250</td>\n",
       "      <td>0.01575</td>\n",
       "      <td>0.01250</td>\n",
       "      <td>0.02000</td>\n",
       "      <td>0.12225</td>\n",
       "      <td>0.03275</td>\n",
       "      <td>0.02100</td>\n",
       "      <td>0.01100</td>\n",
       "      <td>0.10525</td>\n",
       "      <td>0.01975</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>0.04675</td>\n",
       "      <td>0.05550</td>\n",
       "      <td>0.02925</td>\n",
       "      <td>0.08700</td>\n",
       "      <td>0.04750</td>\n",
       "      <td>0.04775</td>\n",
       "      <td>0.04600</td>\n",
       "      <td>0.14275</td>\n",
       "      <td>0.0285</td>\n",
       "      <td>...</td>\n",
       "      <td>0.06275</td>\n",
       "      <td>0.01950</td>\n",
       "      <td>0.02225</td>\n",
       "      <td>0.02300</td>\n",
       "      <td>0.12200</td>\n",
       "      <td>0.03475</td>\n",
       "      <td>0.01700</td>\n",
       "      <td>0.01800</td>\n",
       "      <td>0.09100</td>\n",
       "      <td>0.01775</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>0.03425</td>\n",
       "      <td>0.03800</td>\n",
       "      <td>0.04050</td>\n",
       "      <td>0.03100</td>\n",
       "      <td>0.06500</td>\n",
       "      <td>0.03575</td>\n",
       "      <td>0.02900</td>\n",
       "      <td>0.08650</td>\n",
       "      <td>0.0320</td>\n",
       "      <td>...</td>\n",
       "      <td>0.05325</td>\n",
       "      <td>0.02800</td>\n",
       "      <td>0.01675</td>\n",
       "      <td>0.03875</td>\n",
       "      <td>0.18200</td>\n",
       "      <td>0.07050</td>\n",
       "      <td>0.01625</td>\n",
       "      <td>0.01425</td>\n",
       "      <td>0.08850</td>\n",
       "      <td>0.01500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>0.04300</td>\n",
       "      <td>0.05325</td>\n",
       "      <td>0.03800</td>\n",
       "      <td>0.04100</td>\n",
       "      <td>0.05400</td>\n",
       "      <td>0.06725</td>\n",
       "      <td>0.02775</td>\n",
       "      <td>0.07650</td>\n",
       "      <td>0.0215</td>\n",
       "      <td>...</td>\n",
       "      <td>0.05350</td>\n",
       "      <td>0.02050</td>\n",
       "      <td>0.01425</td>\n",
       "      <td>0.02550</td>\n",
       "      <td>0.19225</td>\n",
       "      <td>0.02675</td>\n",
       "      <td>0.01625</td>\n",
       "      <td>0.01300</td>\n",
       "      <td>0.08700</td>\n",
       "      <td>0.01600</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 1129 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId        1        2        3        4        5        6        7  \\\n",
       "0        1  0.02875  0.02375  0.06250  0.07575  0.14075  0.14675  0.06350   \n",
       "1        2  0.04125  0.04050  0.06275  0.08275  0.09100  0.06125  0.06925   \n",
       "2        3  0.04675  0.05550  0.02925  0.08700  0.04750  0.04775  0.04600   \n",
       "3        4  0.03425  0.03800  0.04050  0.03100  0.06500  0.03575  0.02900   \n",
       "4        5  0.04300  0.05325  0.03800  0.04100  0.05400  0.06725  0.02775   \n",
       "\n",
       "         8       9  ...     1119     1120     1121     1122     1123     1124  \\\n",
       "0  0.20375  0.2020  ...  0.04050  0.01425  0.03050  0.03500  0.14125  0.05775   \n",
       "1  0.09600  0.0765  ...  0.05250  0.01575  0.01250  0.02000  0.12225  0.03275   \n",
       "2  0.14275  0.0285  ...  0.06275  0.01950  0.02225  0.02300  0.12200  0.03475   \n",
       "3  0.08650  0.0320  ...  0.05325  0.02800  0.01675  0.03875  0.18200  0.07050   \n",
       "4  0.07650  0.0215  ...  0.05350  0.02050  0.01425  0.02550  0.19225  0.02675   \n",
       "\n",
       "      1125     1126     1127     1128  \n",
       "0  0.03900  0.02975  0.08475  0.02200  \n",
       "1  0.02100  0.01100  0.10525  0.01975  \n",
       "2  0.01700  0.01800  0.09100  0.01775  \n",
       "3  0.01625  0.01425  0.08850  0.01500  \n",
       "4  0.01625  0.01300  0.08700  0.01600  \n",
       "\n",
       "[5 rows x 1129 columns]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "\n",
    "# Joining the two DataFrames on the 'movieId' column\n",
    "combined_df = movies_data.merge(scores_pivot, left_on='movieId', right_on='movieId', how='left')\n",
    "\n",
    "# Filling null values with a suitable default value \n",
    "combined_df = combined_df.fillna(0)\n",
    "\n",
    "# Dropping columns that are not used (e.g., 'title', 'genres')\n",
    "columns_to_drop = ['title', 'genres']\n",
    "combined_df = combined_df.drop(columns=columns_to_drop)\n",
    "\n",
    "combined_df.head()\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>(no genres listed)</th>\n",
       "      <th>Action</th>\n",
       "      <th>Adventure</th>\n",
       "      <th>Animation</th>\n",
       "      <th>Children</th>\n",
       "      <th>Comedy</th>\n",
       "      <th>Crime</th>\n",
       "      <th>Documentary</th>\n",
       "      <th>Drama</th>\n",
       "      <th>...</th>\n",
       "      <th>Film-Noir</th>\n",
       "      <th>Horror</th>\n",
       "      <th>IMAX</th>\n",
       "      <th>Musical</th>\n",
       "      <th>Mystery</th>\n",
       "      <th>Romance</th>\n",
       "      <th>Sci-Fi</th>\n",
       "      <th>Thriller</th>\n",
       "      <th>War</th>\n",
       "      <th>Western</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>...</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 21 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId  (no genres listed)  Action  Adventure  Animation  Children  \\\n",
       "0        1                   0       0          1          1         1   \n",
       "1        2                   0       0          1          0         1   \n",
       "2        3                   0       0          0          0         0   \n",
       "3        4                   0       0          0          0         0   \n",
       "4        5                   0       0          0          0         0   \n",
       "\n",
       "   Comedy  Crime  Documentary  Drama  ...  Film-Noir  Horror  IMAX  Musical  \\\n",
       "0       1      0            0      0  ...          0       0     0        0   \n",
       "1       0      0            0      0  ...          0       0     0        0   \n",
       "2       1      0            0      0  ...          0       0     0        0   \n",
       "3       1      0            0      1  ...          0       0     0        0   \n",
       "4       1      0            0      0  ...          0       0     0        0   \n",
       "\n",
       "   Mystery  Romance  Sci-Fi  Thriller  War  Western  \n",
       "0        0        0       0         0    0        0  \n",
       "1        0        0       0         0    0        0  \n",
       "2        0        1       0         0    0        0  \n",
       "3        0        1       0         0    0        0  \n",
       "4        0        0       0         0    0        0  \n",
       "\n",
       "[5 rows x 21 columns]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "# Splitting the 'genres' column and create genre columns\n",
    "genre_columns = movies_data['genres'].str.get_dummies(sep='|')\n",
    "\n",
    "mov_genres_df = pd.concat([movies_data, genre_columns], axis=1)\n",
    "\n",
    "# Drop the original 'genres' column\n",
    "mov_genres_df.drop(['title','genres'], axis = 1, inplace=True)\n",
    "mov_genres_df.head()\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "\n",
    "# Define a function to extract the year from the 'title' field\n",
    "def extract_year(title):\n",
    "    import re\n",
    "    year_match = re.search(r'\\(\\d{4}\\)', title)\n",
    "    if year_match:\n",
    "        year = int(year_match.group()[1:5])\n",
    "        return year\n",
    "    else:\n",
    "        return None\n",
    "\n",
    "# Apply the function to create a 'year' column in 'movies_data'\n",
    "movies_data['year'] = movies_data['title'].apply(extract_year)\n",
    "\n",
    "# Merge 'movies_data' with 'ratings_data' to get rating information\n",
    "merged_data = pd.merge(movies_data, ratings_data, on='movieId', how='inner')\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "merged_data = merged_data.drop(columns=['genres', 'userId', 'rating', 'timestamp'])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>title</th>\n",
       "      <th>year</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Toy Story (1995)</td>\n",
       "      <td>1995.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Toy Story (1995)</td>\n",
       "      <td>1995.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>Toy Story (1995)</td>\n",
       "      <td>1995.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>Toy Story (1995)</td>\n",
       "      <td>1995.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>Toy Story (1995)</td>\n",
       "      <td>1995.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId             title    year\n",
       "0        1  Toy Story (1995)  1995.0\n",
       "1        1  Toy Story (1995)  1995.0\n",
       "2        1  Toy Story (1995)  1995.0\n",
       "3        1  Toy Story (1995)  1995.0\n",
       "4        1  Toy Story (1995)  1995.0"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "merged_data.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define a function to set the \"year_group\"\n",
    "def set_year_group(year):\n",
    "    if year < 1900:\n",
    "        return 0\n",
    "    elif 1900 <= year <= 1975:\n",
    "        return 1\n",
    "    elif 1976 <= year <= 1995:\n",
    "        return 2\n",
    "    elif 1996 <= year <= 2003:\n",
    "        return 3\n",
    "    elif 2004 <= year <= 2009:\n",
    "        return 4\n",
    "    elif 2010 <= year:\n",
    "        return 5\n",
    "    else:\n",
    "        return 0\n",
    "    \n",
    "merged_data['year_group'] = merged_data.apply(lambda x: set_year_group(x['year']), axis=1)\n",
    "#no need title and year fields\n",
    "merged_data.drop(['title','year'], axis = 1, inplace=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>rating_counts</th>\n",
       "      <th>rating_mean</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>57309</td>\n",
       "      <td>3.893708</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>24228</td>\n",
       "      <td>3.251527</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>11804</td>\n",
       "      <td>3.142028</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>2523</td>\n",
       "      <td>2.853547</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>11714</td>\n",
       "      <td>3.058434</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId  rating_counts  rating_mean\n",
       "0        1          57309     3.893708\n",
       "1        2          24228     3.251527\n",
       "2        3          11804     3.142028\n",
       "3        4           2523     2.853547\n",
       "4        5          11714     3.058434"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "movies_rat = ratings_data.groupby(['movieId']).agg({'rating': [np.size, np.mean]}).reset_index()\n",
    "movies_rat.columns = ['movieId','rating_counts', 'rating_mean']\n",
    "movies_rat.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "#defining function to group rating counts\n",
    "def set_rating_group(rating_counts):\n",
    "    if (rating_counts <= 1): return 0\n",
    "    elif (2 <= rating_counts <= 10): return 1\n",
    "    elif (11 <= rating_counts <= 100): return 2\n",
    "    elif (101 <= rating_counts <= 1000): return 3\n",
    "    elif (1001 <= rating_counts <= 5000): return 4\n",
    "    elif (5001 <= rating_counts): return 5\n",
    "    else: return 0\n",
    "movies_rat['rating_group'] = movies_rat.apply(lambda x: set_rating_group(x['rating_counts']), axis=1)\n",
    "#no need rating_counts field\n",
    "movies_rat.drop('rating_counts', axis = 1, inplace=True)\n",
    "mov_rating_df = merged_data.merge(movies_rat, left_on='movieId', right_on='movieId', how='left')\n",
    "mov_rating_df = mov_rating_df.fillna(0)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>year_group</th>\n",
       "      <th>rating_mean</th>\n",
       "      <th>rating_group</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3.893708</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3.893708</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3.893708</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3.893708</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>3.893708</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId  year_group  rating_mean  rating_group\n",
       "0        1           2     3.893708             5\n",
       "1        1           2     3.893708             5\n",
       "2        1           2     3.893708             5\n",
       "3        1           2     3.893708             5\n",
       "4        1           2     3.893708             5"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mov_rating_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>(no genres listed)</th>\n",
       "      <th>Action</th>\n",
       "      <th>Adventure</th>\n",
       "      <th>Animation</th>\n",
       "      <th>Children</th>\n",
       "      <th>Comedy</th>\n",
       "      <th>Crime</th>\n",
       "      <th>Documentary</th>\n",
       "      <th>Drama</th>\n",
       "      <th>...</th>\n",
       "      <th>Film-Noir</th>\n",
       "      <th>Horror</th>\n",
       "      <th>IMAX</th>\n",
       "      <th>Musical</th>\n",
       "      <th>Mystery</th>\n",
       "      <th>Romance</th>\n",
       "      <th>Sci-Fi</th>\n",
       "      <th>Thriller</th>\n",
       "      <th>War</th>\n",
       "      <th>Western</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>...</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>...</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 21 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId  (no genres listed)  Action  Adventure  Animation  Children  \\\n",
       "0        1                   0       0          1          1         1   \n",
       "1        2                   0       0          1          0         1   \n",
       "2        3                   0       0          0          0         0   \n",
       "3        4                   0       0          0          0         0   \n",
       "4        5                   0       0          0          0         0   \n",
       "\n",
       "   Comedy  Crime  Documentary  Drama  ...  Film-Noir  Horror  IMAX  Musical  \\\n",
       "0       1      0            0      0  ...          0       0     0        0   \n",
       "1       0      0            0      0  ...          0       0     0        0   \n",
       "2       1      0            0      0  ...          0       0     0        0   \n",
       "3       1      0            0      1  ...          0       0     0        0   \n",
       "4       1      0            0      0  ...          0       0     0        0   \n",
       "\n",
       "   Mystery  Romance  Sci-Fi  Thriller  War  Western  \n",
       "0        0        0       0         0    0        0  \n",
       "1        0        0       0         0    0        0  \n",
       "2        0        1       0         0    0        0  \n",
       "3        0        1       0         0    0        0  \n",
       "4        0        0       0         0    0        0  \n",
       "\n",
       "[5 rows x 21 columns]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mov_genres_df.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "      <th>...</th>\n",
       "      <th>1119</th>\n",
       "      <th>1120</th>\n",
       "      <th>1121</th>\n",
       "      <th>1122</th>\n",
       "      <th>1123</th>\n",
       "      <th>1124</th>\n",
       "      <th>1125</th>\n",
       "      <th>1126</th>\n",
       "      <th>1127</th>\n",
       "      <th>1128</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>0.02875</td>\n",
       "      <td>0.02375</td>\n",
       "      <td>0.06250</td>\n",
       "      <td>0.07575</td>\n",
       "      <td>0.14075</td>\n",
       "      <td>0.14675</td>\n",
       "      <td>0.06350</td>\n",
       "      <td>0.20375</td>\n",
       "      <td>0.2020</td>\n",
       "      <td>...</td>\n",
       "      <td>0.04050</td>\n",
       "      <td>0.01425</td>\n",
       "      <td>0.03050</td>\n",
       "      <td>0.03500</td>\n",
       "      <td>0.14125</td>\n",
       "      <td>0.05775</td>\n",
       "      <td>0.03900</td>\n",
       "      <td>0.02975</td>\n",
       "      <td>0.08475</td>\n",
       "      <td>0.02200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>0.04125</td>\n",
       "      <td>0.04050</td>\n",
       "      <td>0.06275</td>\n",
       "      <td>0.08275</td>\n",
       "      <td>0.09100</td>\n",
       "      <td>0.06125</td>\n",
       "      <td>0.06925</td>\n",
       "      <td>0.09600</td>\n",
       "      <td>0.0765</td>\n",
       "      <td>...</td>\n",
       "      <td>0.05250</td>\n",
       "      <td>0.01575</td>\n",
       "      <td>0.01250</td>\n",
       "      <td>0.02000</td>\n",
       "      <td>0.12225</td>\n",
       "      <td>0.03275</td>\n",
       "      <td>0.02100</td>\n",
       "      <td>0.01100</td>\n",
       "      <td>0.10525</td>\n",
       "      <td>0.01975</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>0.04675</td>\n",
       "      <td>0.05550</td>\n",
       "      <td>0.02925</td>\n",
       "      <td>0.08700</td>\n",
       "      <td>0.04750</td>\n",
       "      <td>0.04775</td>\n",
       "      <td>0.04600</td>\n",
       "      <td>0.14275</td>\n",
       "      <td>0.0285</td>\n",
       "      <td>...</td>\n",
       "      <td>0.06275</td>\n",
       "      <td>0.01950</td>\n",
       "      <td>0.02225</td>\n",
       "      <td>0.02300</td>\n",
       "      <td>0.12200</td>\n",
       "      <td>0.03475</td>\n",
       "      <td>0.01700</td>\n",
       "      <td>0.01800</td>\n",
       "      <td>0.09100</td>\n",
       "      <td>0.01775</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>0.03425</td>\n",
       "      <td>0.03800</td>\n",
       "      <td>0.04050</td>\n",
       "      <td>0.03100</td>\n",
       "      <td>0.06500</td>\n",
       "      <td>0.03575</td>\n",
       "      <td>0.02900</td>\n",
       "      <td>0.08650</td>\n",
       "      <td>0.0320</td>\n",
       "      <td>...</td>\n",
       "      <td>0.05325</td>\n",
       "      <td>0.02800</td>\n",
       "      <td>0.01675</td>\n",
       "      <td>0.03875</td>\n",
       "      <td>0.18200</td>\n",
       "      <td>0.07050</td>\n",
       "      <td>0.01625</td>\n",
       "      <td>0.01425</td>\n",
       "      <td>0.08850</td>\n",
       "      <td>0.01500</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>0.04300</td>\n",
       "      <td>0.05325</td>\n",
       "      <td>0.03800</td>\n",
       "      <td>0.04100</td>\n",
       "      <td>0.05400</td>\n",
       "      <td>0.06725</td>\n",
       "      <td>0.02775</td>\n",
       "      <td>0.07650</td>\n",
       "      <td>0.0215</td>\n",
       "      <td>...</td>\n",
       "      <td>0.05350</td>\n",
       "      <td>0.02050</td>\n",
       "      <td>0.01425</td>\n",
       "      <td>0.02550</td>\n",
       "      <td>0.19225</td>\n",
       "      <td>0.02675</td>\n",
       "      <td>0.01625</td>\n",
       "      <td>0.01300</td>\n",
       "      <td>0.08700</td>\n",
       "      <td>0.01600</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 1129 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId        1        2        3        4        5        6        7  \\\n",
       "0        1  0.02875  0.02375  0.06250  0.07575  0.14075  0.14675  0.06350   \n",
       "1        2  0.04125  0.04050  0.06275  0.08275  0.09100  0.06125  0.06925   \n",
       "2        3  0.04675  0.05550  0.02925  0.08700  0.04750  0.04775  0.04600   \n",
       "3        4  0.03425  0.03800  0.04050  0.03100  0.06500  0.03575  0.02900   \n",
       "4        5  0.04300  0.05325  0.03800  0.04100  0.05400  0.06725  0.02775   \n",
       "\n",
       "         8       9  ...     1119     1120     1121     1122     1123     1124  \\\n",
       "0  0.20375  0.2020  ...  0.04050  0.01425  0.03050  0.03500  0.14125  0.05775   \n",
       "1  0.09600  0.0765  ...  0.05250  0.01575  0.01250  0.02000  0.12225  0.03275   \n",
       "2  0.14275  0.0285  ...  0.06275  0.01950  0.02225  0.02300  0.12200  0.03475   \n",
       "3  0.08650  0.0320  ...  0.05325  0.02800  0.01675  0.03875  0.18200  0.07050   \n",
       "4  0.07650  0.0215  ...  0.05350  0.02050  0.01425  0.02550  0.19225  0.02675   \n",
       "\n",
       "      1125     1126     1127     1128  \n",
       "0  0.03900  0.02975  0.08475  0.02200  \n",
       "1  0.02100  0.01100  0.10525  0.01975  \n",
       "2  0.01700  0.01800  0.09100  0.01775  \n",
       "3  0.01625  0.01425  0.08850  0.01500  \n",
       "4  0.01625  0.01300  0.08700  0.01600  \n",
       "\n",
       "[5 rows x 1129 columns]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "combined_df.head()\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "combined_df = combined_df.set_index('movieId')\n",
    "mov_genres_df = mov_genres_df.set_index('movieId')\n",
    "mov_rating_df = mov_rating_df.set_index('movieId')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get 15% of the data\n",
    "sample_size = int(0.15 * len(combined_df))\n",
    "\n",
    "# Select the first 15% of the data\n",
    "combined_df_sample = combined_df.head(sample_size)\n",
    "mov_genres_df_sample = mov_genres_df.head(sample_size)\n",
    "mov_rating_df_sample = mov_rating_df.head(sample_size)\n",
    "\n",
    "\n",
    "\n",
    "#cosine similarity for mov_tag_df\n",
    "cos_tag = cosine_similarity(combined_df_sample.values)*0.5\n",
    "#cosine similarity for mov_genres_df\n",
    "cos_genres = cosine_similarity(mov_genres_df_sample.values)*0.25\n",
    "#cosine similarity for mov_rating_df\n",
    "cos_rating = cosine_similarity(mov_rating_df_sample.values)*0.25\n",
    "#mix\n",
    "cos = cos_tag+cos_genres+cos_rating\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "      <th>10</th>\n",
       "      <th>...</th>\n",
       "      <th>27800</th>\n",
       "      <th>27801</th>\n",
       "      <th>27802</th>\n",
       "      <th>27803</th>\n",
       "      <th>27805</th>\n",
       "      <th>27808</th>\n",
       "      <th>27811</th>\n",
       "      <th>27812</th>\n",
       "      <th>27815</th>\n",
       "      <th>27816</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>movieId</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.831725</td>\n",
       "      <td>0.674146</td>\n",
       "      <td>0.637076</td>\n",
       "      <td>0.686369</td>\n",
       "      <td>0.560834</td>\n",
       "      <td>0.655332</td>\n",
       "      <td>0.753187</td>\n",
       "      <td>0.515286</td>\n",
       "      <td>0.633894</td>\n",
       "      <td>...</td>\n",
       "      <td>0.735374</td>\n",
       "      <td>0.575723</td>\n",
       "      <td>0.578037</td>\n",
       "      <td>0.564405</td>\n",
       "      <td>0.329057</td>\n",
       "      <td>0.636987</td>\n",
       "      <td>0.329057</td>\n",
       "      <td>0.543698</td>\n",
       "      <td>0.593746</td>\n",
       "      <td>0.615282</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.831725</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.589896</td>\n",
       "      <td>0.572155</td>\n",
       "      <td>0.575346</td>\n",
       "      <td>0.509743</td>\n",
       "      <td>0.574570</td>\n",
       "      <td>0.834748</td>\n",
       "      <td>0.561706</td>\n",
       "      <td>0.667870</td>\n",
       "      <td>...</td>\n",
       "      <td>0.665920</td>\n",
       "      <td>0.564855</td>\n",
       "      <td>0.549356</td>\n",
       "      <td>0.500037</td>\n",
       "      <td>0.250000</td>\n",
       "      <td>0.556929</td>\n",
       "      <td>0.250000</td>\n",
       "      <td>0.509122</td>\n",
       "      <td>0.547729</td>\n",
       "      <td>0.604961</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.674146</td>\n",
       "      <td>0.589896</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.829642</td>\n",
       "      <td>0.853264</td>\n",
       "      <td>0.566662</td>\n",
       "      <td>0.886444</td>\n",
       "      <td>0.605838</td>\n",
       "      <td>0.565555</td>\n",
       "      <td>0.586682</td>\n",
       "      <td>...</td>\n",
       "      <td>0.566597</td>\n",
       "      <td>0.589296</td>\n",
       "      <td>0.626221</td>\n",
       "      <td>0.550958</td>\n",
       "      <td>0.500000</td>\n",
       "      <td>0.828961</td>\n",
       "      <td>0.375000</td>\n",
       "      <td>0.545596</td>\n",
       "      <td>0.554486</td>\n",
       "      <td>0.567383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.637076</td>\n",
       "      <td>0.572155</td>\n",
       "      <td>0.829642</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.764340</td>\n",
       "      <td>0.553911</td>\n",
       "      <td>0.857609</td>\n",
       "      <td>0.629322</td>\n",
       "      <td>0.544953</td>\n",
       "      <td>0.551794</td>\n",
       "      <td>...</td>\n",
       "      <td>0.563490</td>\n",
       "      <td>0.564430</td>\n",
       "      <td>0.650616</td>\n",
       "      <td>0.713554</td>\n",
       "      <td>0.454124</td>\n",
       "      <td>0.906792</td>\n",
       "      <td>0.454124</td>\n",
       "      <td>0.547241</td>\n",
       "      <td>0.716125</td>\n",
       "      <td>0.637112</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>0.686369</td>\n",
       "      <td>0.575346</td>\n",
       "      <td>0.853264</td>\n",
       "      <td>0.764340</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>0.512084</td>\n",
       "      <td>0.803402</td>\n",
       "      <td>0.581541</td>\n",
       "      <td>0.534361</td>\n",
       "      <td>0.544867</td>\n",
       "      <td>...</td>\n",
       "      <td>0.527277</td>\n",
       "      <td>0.540635</td>\n",
       "      <td>0.574835</td>\n",
       "      <td>0.529196</td>\n",
       "      <td>0.426777</td>\n",
       "      <td>0.782594</td>\n",
       "      <td>0.426777</td>\n",
       "      <td>0.516374</td>\n",
       "      <td>0.548519</td>\n",
       "      <td>0.528083</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 9363 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "            1         2         3         4         5         6         7      \\\n",
       "movieId                                                                         \n",
       "1        1.000000  0.831725  0.674146  0.637076  0.686369  0.560834  0.655332   \n",
       "2        0.831725  1.000000  0.589896  0.572155  0.575346  0.509743  0.574570   \n",
       "3        0.674146  0.589896  1.000000  0.829642  0.853264  0.566662  0.886444   \n",
       "4        0.637076  0.572155  0.829642  1.000000  0.764340  0.553911  0.857609   \n",
       "5        0.686369  0.575346  0.853264  0.764340  1.000000  0.512084  0.803402   \n",
       "\n",
       "            8         9         10     ...     27800     27801     27802  \\\n",
       "movieId                                ...                                 \n",
       "1        0.753187  0.515286  0.633894  ...  0.735374  0.575723  0.578037   \n",
       "2        0.834748  0.561706  0.667870  ...  0.665920  0.564855  0.549356   \n",
       "3        0.605838  0.565555  0.586682  ...  0.566597  0.589296  0.626221   \n",
       "4        0.629322  0.544953  0.551794  ...  0.563490  0.564430  0.650616   \n",
       "5        0.581541  0.534361  0.544867  ...  0.527277  0.540635  0.574835   \n",
       "\n",
       "            27803     27805     27808     27811     27812     27815     27816  \n",
       "movieId                                                                        \n",
       "1        0.564405  0.329057  0.636987  0.329057  0.543698  0.593746  0.615282  \n",
       "2        0.500037  0.250000  0.556929  0.250000  0.509122  0.547729  0.604961  \n",
       "3        0.550958  0.500000  0.828961  0.375000  0.545596  0.554486  0.567383  \n",
       "4        0.713554  0.454124  0.906792  0.454124  0.547241  0.716125  0.637112  \n",
       "5        0.529196  0.426777  0.782594  0.426777  0.516374  0.548519  0.528083  \n",
       "\n",
       "[5 rows x 9363 columns]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cols = combined_df_sample.index.values\n",
    "inx = combined_df_sample.index\n",
    "cos_sim_df = pd.DataFrame(cos, columns=cols, index=inx)\n",
    "cos_sim_df.head()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_similar(movieId):\n",
    "    df = cos_sim_df.loc[cos_sim_df.index == movieId].reset_index(). \\\n",
    "            melt(id_vars='movieId', var_name='sim_moveId', value_name='relevance'). \\\n",
    "            sort_values('relevance', axis=0, ascending=False)[1:6]\n",
    "    return df\n",
    "#create empty df\n",
    "movies_similarity = pd.DataFrame(columns=['movieId','sim_moveId','relevance'])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "for x in cos_sim_df.index.tolist():\n",
    "    movies_similarity = movies_similarity.append(get_similar(x))\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>sim_moveId</th>\n",
       "      <th>relevance</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>4780</th>\n",
       "      <td>1</td>\n",
       "      <td>4886</td>\n",
       "      <td>0.978072</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3021</th>\n",
       "      <td>1</td>\n",
       "      <td>3114</td>\n",
       "      <td>0.976056</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2264</th>\n",
       "      <td>1</td>\n",
       "      <td>2355</td>\n",
       "      <td>0.946367</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2203</th>\n",
       "      <td>1</td>\n",
       "      <td>2294</td>\n",
       "      <td>0.942616</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6258</th>\n",
       "      <td>1</td>\n",
       "      <td>6377</td>\n",
       "      <td>0.938101</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     movieId sim_moveId  relevance\n",
       "4780       1       4886   0.978072\n",
       "3021       1       3114   0.976056\n",
       "2264       1       2355   0.946367\n",
       "2203       1       2294   0.942616\n",
       "6258       1       6377   0.938101"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "movies_similarity.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [],
   "source": [
    "def movie_recommender(movieId):\n",
    "    df = cos_sim_df.loc[cos_sim_df.index == movieId].reset_index(). \\\n",
    "            melt(id_vars='movieId', var_name='sim_moveId', value_name='relevance'). \\\n",
    "            sort_values('relevance', axis=0, ascending=False)[1:6]\n",
    "    df['sim_moveId'] = df['sim_moveId'].astype(int)\n",
    "    sim_df = movies_data.merge(df, left_on='movieId', right_on='sim_moveId', how='inner'). \\\n",
    "                sort_values('relevance', axis=0, ascending=False). \\\n",
    "                loc[: , ['movieId_y','title','genres']]. \\\n",
    "                rename(columns={ 'movieId_y': \"movieId\" })\n",
    "    return sim_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>title</th>\n",
       "      <th>genres</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>Monsters, Inc. (2001)</td>\n",
       "      <td>Adventure|Animation|Children|Comedy|Fantasy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>Toy Story 2 (1999)</td>\n",
       "      <td>Adventure|Animation|Children|Comedy|Fantasy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Bug's Life, A (1998)</td>\n",
       "      <td>Adventure|Animation|Children|Comedy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Antz (1998)</td>\n",
       "      <td>Adventure|Animation|Children|Comedy|Fantasy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>Finding Nemo (2003)</td>\n",
       "      <td>Adventure|Animation|Children|Comedy</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId                  title                                       genres\n",
       "3        1  Monsters, Inc. (2001)  Adventure|Animation|Children|Comedy|Fantasy\n",
       "2        1     Toy Story 2 (1999)  Adventure|Animation|Children|Comedy|Fantasy\n",
       "1        1   Bug's Life, A (1998)          Adventure|Animation|Children|Comedy\n",
       "0        1            Antz (1998)  Adventure|Animation|Children|Comedy|Fantasy\n",
       "4        1    Finding Nemo (2003)          Adventure|Animation|Children|Comedy"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#get recommendation for Toy Story\n",
    "movie_recommender(1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>title</th>\n",
       "      <th>genres</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2542</td>\n",
       "      <td>Snatch (2000)</td>\n",
       "      <td>Comedy|Crime|Thriller</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2542</td>\n",
       "      <td>Get Shorty (1995)</td>\n",
       "      <td>Comedy|Crime|Thriller</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2542</td>\n",
       "      <td>Two Hands (1999)</td>\n",
       "      <td>Comedy|Crime|Thriller</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2542</td>\n",
       "      <td>Pulp Fiction (1994)</td>\n",
       "      <td>Comedy|Crime|Drama|Thriller</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2542</td>\n",
       "      <td>Go (1999)</td>\n",
       "      <td>Comedy|Crime</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId                title                       genres\n",
       "3     2542        Snatch (2000)        Comedy|Crime|Thriller\n",
       "0     2542    Get Shorty (1995)        Comedy|Crime|Thriller\n",
       "4     2542     Two Hands (1999)        Comedy|Crime|Thriller\n",
       "1     2542  Pulp Fiction (1994)  Comedy|Crime|Drama|Thriller\n",
       "2     2542            Go (1999)                 Comedy|Crime"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#get recommendation for Lock, Stock & Two Smoking Barrels\n",
    "movie_recommender(2542)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>title</th>\n",
       "      <th>genres</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>7361</td>\n",
       "      <td>Open Your Eyes (Abre los ojos) (1997)</td>\n",
       "      <td>Drama|Romance|Sci-Fi|Thriller</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>7361</td>\n",
       "      <td>Solaris (2002)</td>\n",
       "      <td>Drama|Romance|Sci-Fi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>7361</td>\n",
       "      <td>Princess and the Warrior, The (Krieger und die...</td>\n",
       "      <td>Drama|Romance</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>7361</td>\n",
       "      <td>American Beauty (1999)</td>\n",
       "      <td>Drama|Romance</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>7361</td>\n",
       "      <td>Before Sunset (2004)</td>\n",
       "      <td>Drama|Romance</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId                                              title  \\\n",
       "0     7361              Open Your Eyes (Abre los ojos) (1997)   \n",
       "3     7361                                     Solaris (2002)   \n",
       "2     7361  Princess and the Warrior, The (Krieger und die...   \n",
       "1     7361                             American Beauty (1999)   \n",
       "4     7361                               Before Sunset (2004)   \n",
       "\n",
       "                          genres  \n",
       "0  Drama|Romance|Sci-Fi|Thriller  \n",
       "3           Drama|Romance|Sci-Fi  \n",
       "2                  Drama|Romance  \n",
       "1                  Drama|Romance  \n",
       "4                  Drama|Romance  "
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#get recommendation for Eternal Sunshine of the Spotless Mind\n",
    "movie_recommender(7361)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Calculate the number of rows to select for each dataset (30% of its total number of rows)\n",
    "sample_size_genome = int(0.1 * len(genome_scores_data))\n",
    "sample_size_movies = int(0.1 * len(movies_data))\n",
    "sample_size_ratings = int(0.1 * len(ratings_data))\n",
    "\n",
    "# Getting the first 30% of the data from each dataset\n",
    "genome_scores_data = genome_scores_data.head(sample_size_genome)\n",
    "movies_data = movies_data.head(sample_size_movies)\n",
    "ratings_data = ratings_data.head(sample_size_ratings)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   userId\n",
       "0       1\n",
       "1       2\n",
       "2       3\n",
       "3       4\n",
       "4       5"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#using ‘ratings.csv’ data and extract unique userIds.\n",
    "\n",
    "users_df = pd.DataFrame(ratings_data['userId'].unique(), columns=['userId'])\n",
    "users_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>title</th>\n",
       "      <th>year</th>\n",
       "      <th>rating_mean</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Toy Story (1995)</td>\n",
       "      <td>1995.0</td>\n",
       "      <td>3.903468</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>Jumanji (1995)</td>\n",
       "      <td>1995.0</td>\n",
       "      <td>3.273569</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>Grumpier Old Men (1995)</td>\n",
       "      <td>1995.0</td>\n",
       "      <td>3.127759</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>Waiting to Exhale (1995)</td>\n",
       "      <td>1995.0</td>\n",
       "      <td>2.957490</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>Father of the Bride Part II (1995)</td>\n",
       "      <td>1995.0</td>\n",
       "      <td>3.084100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   movieId                               title    year  rating_mean\n",
       "0        1                    Toy Story (1995)  1995.0     3.903468\n",
       "1        2                      Jumanji (1995)  1995.0     3.273569\n",
       "2        3             Grumpier Old Men (1995)  1995.0     3.127759\n",
       "3        4            Waiting to Exhale (1995)  1995.0     2.957490\n",
       "4        5  Father of the Bride Part II (1995)  1995.0     3.084100"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#create movies_df\n",
    "movies_df = movies_data.drop('genres', axis = 1)\n",
    "#calculate mean of ratings for each movies\n",
    "agg_rating_avg = ratings_data.groupby(['movieId']).agg({'rating': np.mean}).reset_index()\n",
    "agg_rating_avg.columns = ['movieId', 'rating_mean']\n",
    "#merge\n",
    "movies_df = movies_df.merge(agg_rating_avg, left_on='movieId', right_on='movieId', how='left')\n",
    "movies_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>genres</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Action</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Adventure</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Animation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Children</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Comedy</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      genres\n",
       "0     Action\n",
       "1  Adventure\n",
       "2  Animation\n",
       "3   Children\n",
       "4     Comedy"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "genres = [\n",
    "    \"Action\",\n",
    "    \"Adventure\",\n",
    "    \"Animation\",\n",
    "    \"Children\",\n",
    "    \"Comedy\",\n",
    "    \"Crime\",\n",
    "    \"Documentary\",\n",
    "    \"Drama\",\n",
    "    \"Fantasy\",\n",
    "    \"Film-Noir\",\n",
    "    \"Horror\",\n",
    "    \"Musical\",\n",
    "    \"Mystery\",\n",
    "    \"Romance\",\n",
    "    \"Sci-Fi\",\n",
    "    \"Thriller\",\n",
    "    \"War\",\n",
    "    \"Western\",\n",
    "    \"(no genres listed)\"]\n",
    "genres_df = pd.DataFrame(genres, columns=['genres'])\n",
    "genres_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userId</th>\n",
       "      <th>movieId</th>\n",
       "      <th>rating</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>296</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>306</td>\n",
       "      <td>3.5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>307</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>665</td>\n",
       "      <td>5.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>899</td>\n",
       "      <td>3.5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   userId  movieId  rating\n",
       "0       1      296     5.0\n",
       "1       1      306     3.5\n",
       "2       1      307     5.0\n",
       "3       1      665     5.0\n",
       "4       1      899     3.5"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "users_movies_df = ratings_data.drop('timestamp', axis = 1)\n",
    "users_movies_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [],
   "source": [
    "movies_genres_df = movies_data.drop('title', axis = 1)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "#defining a function to split genres field\n",
    "def get_movie_genres(movieId):\n",
    "    movie = movies_genres_df[movies_genres_df['movieId']==movieId]\n",
    "    genres = movie['genres'].tolist()\n",
    "    df = pd.DataFrame([b for a in [i.split('|') for i in genres] for b in a], columns=['genres'])\n",
    "    df.insert(loc=0, column='movieId', value=movieId)\n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movieId</th>\n",
       "      <th>genres</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Adventure</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Animation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>Children</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>Comedy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>Fantasy</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  movieId     genres\n",
       "0       1  Adventure\n",
       "1       1  Animation\n",
       "2       1   Children\n",
       "3       1     Comedy\n",
       "4       1    Fantasy"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#create empty df\n",
    "movies_genres=pd.DataFrame(columns=['movieId','genres'])\n",
    "for x in movies_genres_df['movieId'].tolist():\n",
    "    movies_genres=movies_genres.append(get_movie_genres(x))\n",
    "movies_genres.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userId</th>\n",
       "      <th>genres</th>\n",
       "      <th>year</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Comedy|Crime|Drama|Thriller</td>\n",
       "      <td>1994.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Drama</td>\n",
       "      <td>1994.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>Drama</td>\n",
       "      <td>1993.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>Comedy|Drama|War</td>\n",
       "      <td>1995.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>Comedy|Musical|Romance</td>\n",
       "      <td>1952.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   userId                       genres    year\n",
       "0       1  Comedy|Crime|Drama|Thriller  1994.0\n",
       "1       1                        Drama  1994.0\n",
       "2       1                        Drama  1993.0\n",
       "3       1             Comedy|Drama|War  1995.0\n",
       "4       1       Comedy|Musical|Romance  1952.0"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#join to movies data to get genre information\n",
    "user_genres_df = ratings_data.merge(movies_data, left_on='movieId', right_on='movieId', how='left')\n",
    "#drop columns that will not be used\n",
    "user_genres_df.drop(['movieId','rating','timestamp','title'], axis = 1, inplace=True)\n",
    "user_genres_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_favorite_genre(userId):\n",
    "    user = user_genres_df[user_genres_df['userId']==userId]\n",
    "    genres = user['genres'].tolist()\n",
    "    if not genres:\n",
    "        return \"No suggestion\"\n",
    "    else:\n",
    "        movie_list = [b for a in [i.split('|') for i in genres] for b in a]\n",
    "        counter = Counter(movie_list)\n",
    "        return counter.most_common(1)[0][0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [],
   "source": [
    "user_genres_df.dropna(inplace=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>userId</th>\n",
       "      <th>genre</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Drama</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>Drama</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3</td>\n",
       "      <td>Drama</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4</td>\n",
       "      <td>Comedy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>5</td>\n",
       "      <td>Comedy</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  userId   genre\n",
       "0      1   Drama\n",
       "0      2   Drama\n",
       "0      3   Drama\n",
       "0      4  Comedy\n",
       "0      5  Comedy"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#create empty df\n",
    "users_genres = pd.DataFrame(columns=['userId','genre'])\n",
    "for x in users_df['userId'].tolist():\n",
    "    users_genres = users_genres.append(pd.DataFrame([[x,get_favorite_genre(x)]], columns=['userId','genre']))\n",
    "users_genres.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "users_df.to_csv('users.csv', sep='|', header=True, index=False)\n",
    "movies_df.to_csv('movies.csv', sep='|', header=True, index=False)\n",
    "genres_df.to_csv('genres.csv', sep='|', header=True, index=False)\n",
    "users_movies_df.to_csv('users_movies.csv', sep='|', header=True, index=False)\n",
    "movies_genres.to_csv('movies_genres.csv', sep='|', header=True, index=False)\n",
    "users_genres.to_csv('users_genres.csv', sep='|', header=True, index=False)\n",
    "movies_similarity.to_csv('movies_similarity.csv', sep='|', header=True, index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "# Define a connection to the database\n",
    "uri = \"bolt://localhost:7687\"  # Replace with your database URI\n",
    "username = \"neo4j\"     # Replace with your username\n",
    "password = \"12345678\"     # Replace with your password\n",
    "\n",
    "# Create a connection to the database\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": [
    "session=driver.session()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\ADHISH S\\AppData\\Roaming\\Python\\Python37\\site-packages\\ipykernel_launcher.py:11: DeprecationWarning: write_transaction has been renamed to execute_write\n",
      "  # This is added back by InteractiveShellApp.init_path()\n"
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM \"file:///users.csv\" AS row\n",
    "FIELDTERMINATOR '|'\n",
    "CREATE (:Users {userId: row.userId});\n",
    "\"\"\"\n",
    "\n",
    "# Function to execute the Cypher query\n",
    "def execute_cypher_query(query):\n",
    "    with GraphDatabase.driver(uri, auth=(username, password)) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.write_transaction(lambda tx: tx.run(query))\n",
    "            # Perform any necessary processing or error handling here\n",
    "            return\n",
    "\n",
    "# Execute the Cypher query\n",
    "execute_cypher_query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:0' labels=frozenset({'Users'}) properties={'userId': '1'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:1' labels=frozenset({'Users'}) properties={'userId': '2'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:2' labels=frozenset({'Users'}) properties={'userId': '3'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:3' labels=frozenset({'Users'}) properties={'userId': '4'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:4' labels=frozenset({'Users'}) properties={'userId': '5'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:5' labels=frozenset({'Users'}) properties={'userId': '6'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:6' labels=frozenset({'Users'}) properties={'userId': '7'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:7' labels=frozenset({'Users'}) properties={'userId': '8'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:8' labels=frozenset({'Users'}) properties={'userId': '9'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:9' labels=frozenset({'Users'}) properties={'userId': '10'}>>\n"
     ]
    }
   ],
   "source": [
    "q1='MATCH (n:Users) RETURN n LIMIT 10'\n",
    "nodes=session.run(q1)\n",
    "for node in nodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\ADHISH S\\AppData\\Roaming\\Python\\Python37\\site-packages\\ipykernel_launcher.py:11: DeprecationWarning: write_transaction has been renamed to execute_write\n",
      "  # This is added back by InteractiveShellApp.init_path()\n"
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///movies.csv' AS row\n",
    "FIELDTERMINATOR '|'\n",
    "CREATE (:Movies {movieId: row.movieId, title: row.title, rating_mean: row.rating_mean});\n",
    "\"\"\"\n",
    "\n",
    "# Function to execute the Cypher query\n",
    "def execute_cypher_query(query):\n",
    "    with GraphDatabase.driver(uri, auth=(username, password)) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.write_transaction(lambda tx: tx.run(query))\n",
    "            # Perform any necessary processing or error handling here\n",
    "            return\n",
    "\n",
    "# Execute the Cypher query\n",
    "execute_cypher_query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:16658' labels=frozenset({'Movies'}) properties={'rating_mean': '3.9034683068511873', 'movieId': '1', 'title': 'Toy Story (1995)'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:16659' labels=frozenset({'Movies'}) properties={'rating_mean': '3.273569370111157', 'movieId': '2', 'title': 'Jumanji (1995)'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:16660' labels=frozenset({'Movies'}) properties={'rating_mean': '3.127758913412564', 'movieId': '3', 'title': 'Grumpier Old Men (1995)'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:16661' labels=frozenset({'Movies'}) properties={'rating_mean': '2.95748987854251', 'movieId': '4', 'title': 'Waiting to Exhale (1995)'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:16662' labels=frozenset({'Movies'}) properties={'rating_mean': '3.084100418410042', 'movieId': '5', 'title': 'Father of the Bride Part II (1995)'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:16663' labels=frozenset({'Movies'}) properties={'rating_mean': '3.8539857932123125', 'movieId': '6', 'title': 'Heat (1995)'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:16664' labels=frozenset({'Movies'}) properties={'rating_mean': '3.3694214876033057', 'movieId': '7', 'title': 'Sabrina (1995)'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:16665' labels=frozenset({'Movies'}) properties={'rating_mean': '3.261029411764706', 'movieId': '8', 'title': 'Tom and Huck (1995)'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:16666' labels=frozenset({'Movies'}) properties={'rating_mean': '3.0065789473684212', 'movieId': '9', 'title': 'Sudden Death (1995)'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:16667' labels=frozenset({'Movies'}) properties={'rating_mean': '3.4390845070422533', 'movieId': '10', 'title': 'GoldenEye (1995)'}>>\n"
     ]
    }
   ],
   "source": [
    "q1='MATCH (n:Movies) RETURN n LIMIT 10'\n",
    "nodes1=session.run(q1)\n",
    "for node in nodes1:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\ADHISH S\\AppData\\Roaming\\Python\\Python37\\site-packages\\ipykernel_launcher.py:11: DeprecationWarning: write_transaction has been renamed to execute_write\n",
      "  # This is added back by InteractiveShellApp.init_path()\n"
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///genres.csv' AS row\n",
    "FIELDTERMINATOR '|'\n",
    "CREATE (:Genres {genres: row.genres});\n",
    "\"\"\"\n",
    "\n",
    "# Function to execute the Cypher query\n",
    "def execute_cypher_query(query):\n",
    "    with GraphDatabase.driver(uri, auth=(username, password)) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.write_transaction(lambda tx: tx.run(query))\n",
    "            # Perform any necessary processing or error handling here\n",
    "            return\n",
    "\n",
    "# Execute the Cypher query\n",
    "execute_cypher_query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22900' labels=frozenset({'Genres'}) properties={'genres': 'Action'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22901' labels=frozenset({'Genres'}) properties={'genres': 'Adventure'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22902' labels=frozenset({'Genres'}) properties={'genres': 'Animation'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22903' labels=frozenset({'Genres'}) properties={'genres': 'Children'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22904' labels=frozenset({'Genres'}) properties={'genres': 'Comedy'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22905' labels=frozenset({'Genres'}) properties={'genres': 'Crime'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22906' labels=frozenset({'Genres'}) properties={'genres': 'Documentary'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22907' labels=frozenset({'Genres'}) properties={'genres': 'Drama'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22908' labels=frozenset({'Genres'}) properties={'genres': 'Fantasy'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22909' labels=frozenset({'Genres'}) properties={'genres': 'Film-Noir'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22910' labels=frozenset({'Genres'}) properties={'genres': 'Horror'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22911' labels=frozenset({'Genres'}) properties={'genres': 'Musical'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22912' labels=frozenset({'Genres'}) properties={'genres': 'Mystery'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22913' labels=frozenset({'Genres'}) properties={'genres': 'Romance'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22914' labels=frozenset({'Genres'}) properties={'genres': 'Sci-Fi'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22915' labels=frozenset({'Genres'}) properties={'genres': 'Thriller'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22916' labels=frozenset({'Genres'}) properties={'genres': 'War'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22917' labels=frozenset({'Genres'}) properties={'genres': 'Western'}>>\n",
      "<Record n=<Node element_id='4:f29a9674-2f1a-4369-a5d0-6589ae322efc:22918' labels=frozenset({'Genres'}) properties={'genres': '(no genres listed)'}>>\n"
     ]
    }
   ],
   "source": [
    "q1='MATCH (n:Genres) RETURN n LIMIT 25'\n",
    "nodes2=session.run(q1)\n",
    "for node in nodes2:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\ADHISH S\\AppData\\Roaming\\Python\\Python37\\site-packages\\ipykernel_launcher.py:13: DeprecationWarning: write_transaction has been renamed to execute_write\n",
      "  del sys.path[0]\n"
     ]
    }
   ],
   "source": [
    "cypher_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///users_movies.csv' AS row\n",
    "FIELDTERMINATOR '|'\n",
    "MATCH (user:Users {userId: row.userId})\n",
    "MATCH (movie:Movies {movieId: row.movieId})\n",
    "MERGE (user)-[:WATCHED {rating: row.rating}]->(movie);\n",
    "\"\"\"\n",
    "\n",
    "# Function to execute the Cypher query\n",
    "def execute_cypher_query(query):\n",
    "    with GraphDatabase.driver(uri, auth=(username, password)) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.write_transaction(lambda tx: tx.run(query))\n",
    "            # Perform any necessary processing or error handling here\n",
    "            return\n",
    "\n",
    "# Execute the Cypher query\n",
    "execute_cypher_query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "q1='MATCH p=()-[r:WATCHED]->() RETURN p LIMIT 25'\n",
    "nodes3=session.run(q1)\n",
    "for node in nodes3:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///users_genres.csv' AS row\n",
    "FIELDTERMINATOR '|'\n",
    "MATCH (user:Users {userId: row.userId})\n",
    "MATCH (genres:Genres {genres: row.genre})\n",
    "MERGE (user)-[:FAVORITE]->(genres);\n",
    "\"\"\"\n",
    "\n",
    "# Function to execute the Cypher query\n",
    "def execute_cypher_query(query):\n",
    "    with GraphDatabase.driver(uri, auth=(username, password)) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.write_transaction(lambda tx: tx.run(query))\n",
    "            # Perform any necessary processing or error handling here\n",
    "            return\n",
    "\n",
    "# Execute the Cypher query\n",
    "execute_cypher_query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "q1='MATCH p=()-[:FAVORITE]->() RETURN p LIMIT 25'\n",
    "nodes4=session.run(q1)\n",
    "for node in nodes4:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///movies_genres.csv' AS row\n",
    "FIELDTERMINATOR '|'\n",
    "MATCH (movie:Movies {movieId: row.movieId})\n",
    "MATCH (genres:Genres {genres: row.genres})\n",
    "MERGE (movie)-[:GENRES]->(genres);\n",
    "\"\"\"\n",
    "\n",
    "# Function to execute the Cypher query\n",
    "def execute_cypher_query(query):\n",
    "    with GraphDatabase.driver(uri, auth=(username, password)) as driver:\n",
    "        with driver.session() as session:\n",
    "            result = session.write_transaction(lambda tx: tx.run(query))\n",
    "            # Perform any necessary processing or error handling here\n",
    "            return\n",
    "\n",
    "# Execute the Cypher query\n",
    "execute_cypher_query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "q1='MATCH p=()-[:GENRES]->() RETURN p LIMIT 25'\n",
    "nodes5=session.run(q1)\n",
    "for node in nodes5:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_query = \"\"\"\n",
    "LOAD CSV WITH HEADERS FROM 'file:///movies_similarity.csv' AS row\n",
    "FIELDTERMINATOR '|'\n",
    "MATCH (movie1:Movies {movieId: row.movieId})\n",
    "MATCH (movie2:Movies {movieId: row.sim_moveId})\n",
    "MERGE (movie1)-[:SIMILAR {relevance: row.relevance}]->(movie2);\n",
    "\"\"\"\n",
    "execute_cypher_query(cypher_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "q1='MATCH p=()-[:SIMILAR]->() RETURN p LIMIT 25'\n",
    "nodes6=session.run(q1)\n",
    "for node in nodes6:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define your Cypher query\n",
    "q2 = \"MATCH (u:Users)-[:WATCHED]->(m1:Movies) WHERE u.userId =~ '4' RETURN u.userId, m1.title, m1.rating_mean\"\n",
    "\n",
    "# Establish a session and run the query\n",
    "with GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\")) as driver:\n",
    "    with driver.session() as session:\n",
    "        result = session.run(q2)\n",
    "\n",
    "        # Initialize a counter\n",
    "        count = 0\n",
    "\n",
    "        # Iterate through the result and print the first 5 records\n",
    "        for record in result:\n",
    "            if count < 5:\n",
    "                print(\"user:\",record[\"u.userId\"], \"Movie:\",record[\"m1.title\"],\"rating:\",record[\"m1.rating_mean\"])\n",
    "                count += 1\n",
    "            else:\n",
    "                break  # Exit the loop after printing 5 records\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "# Define your Cypher query\n",
    "q4 = \"\"\"\n",
    "MATCH (u:Users)-[:WATCHED]->(m1:Movies)-[s:SIMILAR]->(m2:Movies)\n",
    "WHERE u.userId =~ '4'\n",
    "RETURN u.userId, m1.title, m2.title, m2.rating_mean\n",
    "\"\"\"\n",
    "\n",
    "# Establish a session and run the query\n",
    "with GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\")) as driver:\n",
    "    with driver.session() as session:\n",
    "        result = session.run(q4)\n",
    "        count=0\n",
    "        # Iterate through the result and print each record\n",
    "        for record in result:\n",
    "            if count < 5:\n",
    "                print(record[\"u.userId\"], record[\"m1.title\"], record[\"m2.title\"], record[\"m2.rating_mean\"])\n",
    "            else:\n",
    "                break\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define your Cypher query\n",
    "q4 = \"\"\"\n",
    "MATCH (u:Users)-[:WATCHED]->(m1:Movies)-[s:SIMILAR]->(m2:Movies)\n",
    "WHERE u.userId =~ '4'\n",
    "RETURN u.userId, m1.title, m2.title, m2.rating_mean\n",
    "\"\"\"\n",
    "\n",
    "# Establish a session and run the query\n",
    "with GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\")) as driver:\n",
    "    with driver.session() as session:\n",
    "        result = session.run(q4)\n",
    "\n",
    "        # Initialize a counter\n",
    "        count = 0\n",
    "\n",
    "        # Iterate through the result and print each record, up to 5 records\n",
    "        for record in result:\n",
    "            print(\"user:\",record[\"u.userId\"],\"Movie:\",record[\"m1.title\"], record[\"m2.title\"], record[\"m2.rating_mean\"])\n",
    "            count += 1\n",
    "\n",
    "            # Limit to the first 5 records\n",
    "            if count >= 5:\n",
    "                break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define your Cypher query\n",
    "q5 = \"\"\"\n",
    "MATCH (u1:Users)-[:WATCHED]->(m3:Movies)\n",
    "WHERE u1.userId =~ '5'\n",
    "WITH [i in m3.movieId | i] as movies\n",
    "MATCH path = (u:Users)-[:WATCHED]->(m1:Movies)-[s:SIMILAR]->(m2:Movies),\n",
    "(m2)-[:GENRES]->(g:Genres),\n",
    "(u)-[:FAVORITE]->(g)\n",
    "WHERE u.userId =~ '5' and not m2.movieId in movies\n",
    "RETURN distinct u.userId as userId, g.genres as genres, \n",
    "m2.title as title, m2.rating_mean as rating\n",
    "ORDER BY m2.rating_mean DESCENDING\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "# Establish a session and run the query\n",
    "with GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"password\")) as driver:\n",
    "    with driver.session() as session:\n",
    "        result = session.run(q5)\n",
    "\n",
    "        # Iterate through the result and print each record\n",
    "        for record in result:\n",
    "            print(\"user:\",record[\"userId\"],'genre:', record[\"genres\"], 'movie:',record[\"title\"],'rating:', record[\"rating\"])\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "NEO4J",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
